Feature: Кошик

    Background:
      Given користувач відкрив головну сторінку
      And користувач відкрив каталог

    Scenario: Додавання та видалення книги з кошика
      When користувач додає першу книгу в кошик
      Then у модальному вікні відображається назва доданої книги і кількість 1
      When користувач закриває модальне вікно
      And користувач оновлює сторінку
      Then лічильник товарів у кошику в шапці дорівнює 1
      When користувач відкриває кошик
      Then перший товар у кошику має назву доданої книги
      When користувач видаляє перший товар з кошика
      Then відображається повідомлення про порожній кошик
