Feature: Пагінація каталогу

    Background:
      Given користувач відкрив головну сторінку
      And користувач відкрив каталог

    Scenario: Навігація по сторінках каталогу
      Then перша сторінка активна за замовчуванням
      When користувач переходить на сторінку 3
      Then активною є сторінка 3
      And URL містить "page=3"
      And перша книга на сторінці 3 відрізняється від першої книги на сторінці 1
      When користувач переходить на наступну сторінку
      Then активною є сторінка 4
      When користувач переходить на попередню сторінку
      Then активною є сторінка 3
